<template>
    <div class="main">
        <div class="wallet-nav">
            <img src="http://img.bomaleye.com/2042095331853_7719" alt="" @click="routerToWalletDetail">
            <span>充值协议</span>
            <img src="http://img.bomaleye.com/2042095331853_7719" alt="">
        </div>
        <div class="title"><h2>马蹄通证服务协议</h2></div>
        <div class="content">
                尊敬的伯马乐业用户，欢迎您使用马蹄服务！
                <h4>重要提示：</h4><br>
                本《马蹄通证服务协议》 (以下称“本协议”)由您与伯马乐业平台(以下称“本平台”)运营主体西安信得天下数据服务有限公司(以下称“公司”) 签订;您在使用本服务时，您应阅读并遵守及伯马乐业软件内公布的其他专项协议或规则（包括《伯马乐业用户协议及隐私政策》《伯马乐业职位信息发布规则》《增值服务协议》）的所有条款的约束。
                <br><br>
                您已经获得了相应的服务资格，即您具备相应的民事行为能力签订本协议。若 
                您尚未达到前述与您行为相适应的民事行为能力，您及您的监护人应当依法承担相应后果。 
                请您在使用马蹄服务前仔细阅读并理解本协议，特别是以黑体加粗和加下划线方式突出 
                的条款，这些条款可能对您的权益有重大影响、或涉及免除、限制我们的责任。如果您对 
                本协议的任何条款表示异议，您可以选择不使用；您的使用则意味着您将同意遵守本协议下 
                全部规定。请你审慎阅读并选择是否接受前述协议，如你对本协议有任何疑问，应向客服咨询。
                <br><br>
                本平台不鼓励未成年人使用支付服务，未成年人请委托监护人操作或在监护人明示同意下操作，否则请勿使用本支付服务。

                <h4>第一章 总则</h4> <br>

                第一条 【适用范围】适用于伯马乐业用户购买马蹄以及使用马蹄兑换产品。 <br>
                第二条 【效力级别】本协议是《伯马乐业用户服务协议》的补充协议，本协议中已有规 <br>
                定的，根据本协议执行；本协议未有规定的，参照《伯马乐业用户服务协议》执行。 <br>
                第三条 【马蹄】马蹄是伯马乐业和乐业链的通用兑换通证，可通过充值购买及相关赠送获得和通过劳动获得。马蹄可用来兑换平台上的指定产品及服务，通过劳动所得的马蹄也可以在平台上兑换现金。<br> 

                <h4>第二章马蹄使用规则 </h4><br>
                第四条 【用途】马蹄是我们向您提供的用于在伯马乐业平台上进行消费的通用兑换通证，马蹄可在伯马乐业平台上用于招聘服务（如抢人才、人才悬赏等）、视频服务（如视频播放量推送、视频置顶）、打赏等伯马乐业线上产品。具体伯乐端包括职位刷新、职位置顶、简历下载、抢人才、人才悬赏、视频服务、打赏、平台指定产品及服务兑换等伯马乐业线上产品。千里马端包括求职服务、简历刷新、悬赏、打赏、视频服务、平台指定产品及服务兑换等伯马乐业线上产品。具体马蹄使用产品和服务以伯马乐业官网显示为准。 <br> 
                第五条 【购买途径】您登录伯马乐业账号后，可在首页通过支付宝、微信在线支付等方式购买马蹄；<br>
                第六条 【充值和转账】您可以在伯马乐业平台中充值马蹄，我们提供了几种马蹄充值金额供您选择，您可在充值时选择开具电子发票或增值税专用纸质发票，并输入发票的基本信息；您也可以选择马蹄转账，转账对象只能是同公司下的用户，转账的操作明细将在马蹄明细中体现。<br>
                第七条 【购买金额】通常情况下，1 元人民币可购买 100 个马蹄，具体购买金额以官网页面展示为准。 <br>
                第八条 【马蹄管理】您可以在个人中心对您的资产信息、充值记录、消费记录等信息。 
                进行管理，例如，您可随时在伯马乐业平台页面查看您的马蹄余额情况，并对马蹄进行充值。 <br>
                第九条 【余额保护】当您发现您的账户出现不当使用或有任何其他可能危及余额安全的情形时，应立即联系我们，伯马乐业将积极协助您进行处理。请您理解伯马乐业对（用户）请求采取行动均需要合理时间，且伯马乐业采取的行动可能无法避免或及时阻止侵害后果的形成或扩大。除伯马乐业存在法定过错外，伯马乐业不承担责任。任何责任 <br>
                第十条 【马蹄兑换】马蹄属于在线交付的充值类商品，用户一旦充值成功，充值即确定完成，伯马乐业不提供任何转售、交换、再购买马蹄或逆向兑换服务。请您在充值和转账时谨慎确认账户信息和金额信息。请您在购买马蹄过程中谨慎选择，一旦遵照伯马乐业平台协议按正常流程充值成功，伯马乐业将不提供马蹄的退还服务。  <br>
                第十一条 【有效期】马蹄有效期以马蹄充值界面马蹄套餐有效期为准，自完成支付之日起计算，请注意在有效期内完成消费。 如超过有效期，余额自动清零。并不退还已购买/兑换的马蹄。<br>

                <h4>第三章行为规则与违规处理 </h4><br>
                第十二条【行为规则】您在购买和使用马蹄的过程中，应当符合以下行为规则：<br> 
                1. 您在进行充值时，您应确保您为绑定的支付账户开户人/所有人，合法、有效使用该账户且未侵犯任何第三方权益。如您违反以上承诺，造成支付账户实际所有人或任何第三方受损的，应由您单独负责并解决由此产生的纠纷承担全部法律责任；<br> 
                2. 您应当按照我们所指定的充值方式增加账户所有的马蹄数量，如果您使用非伯马乐业所指定的充值方式或系统进行充值，或以非法的方式进行充值而造成用户权益受损时，您应当对相应的损失或赔偿负责； 伯马乐业不承担任何责任 <br>
                3. 请您务必仔细确认自己的账号及充值金额，因用户自身原因输入账号错误、操作不当或不了解充值计费方式等因素造成充错账号、选错充值种类、填错充值金额等情形而损害自身权益的，应自行承担责任； <br>
                4. 您应当仅将马蹄及使用马蹄购买的服务用于招聘、宣传、短视频服务、鼓励他人等相关目的；<br> 
                5. 您应当谨慎购买由第三方提供的服务，第三方提供相关服务的责任由该第三方承担，伯马乐业不对马蹄的使用做出任何明示或默示保证； <br>
                6. 您充值马蹄后，应保留充值订单号以作为今后发生问题核对依据凭证，如发生问题您可就充值服务进行投诉，但未提供任何有效凭证的，伯马乐业将无法判断充值的真实性从而对投诉做出处理。 <br>
                第十三条【违规处理】为维持网络环境的安全和有序，我们可能对您使用马蹄和购买行
                为进行审查和监督，如有证据证明（包括但不限于收到投诉）您在使用马蹄和购买服务的过程中存在任何违反本协议的行为，我们可能会采取暂停马蹄等服务的使用权限等处理措施。您应在指定的期限内终止违规、违约行为，有必要的情形下出具不再发生违规行为的保证及其他证明文件等，我们审查后将决定是否继续开放服务使用权限，此种审查并不免除您的违规行为应承担的责任。若您未在指定期限内完成履行上述义务，或我们审查后决定您不具有继续开通服务使用权限的条件，或再次出现违规、违约情形的，我们可终止向您提供服务、解除本协议，并不退还已购买/兑换的马蹄，如果伯马乐业因此受到任何损失或造成任何支出，您应承担相应的赔偿责任。
                <h4>第四章免责声明</h4><br>
                第十四条【用户过错】因您自身的原因导致无法购买马蹄服务或购买过程发生任何错误 而产生的任何损失或责任，由您承担全部责任，包括但不限于：  <br> 
                1. 您未按照本协议或其他适用的任何规则进行操作；  <br> 
                2. 因您的伯马乐业账号失效、丢失、被关闭；  <br> 
                3. 因您绑定的第三方支付机构账户的原因导致的损失或责任，包括您使用未经认证的第三方支付账户或使用非您本人的第三方支付账户，您的第三方支付 
                账户被冻结、查封等；  <br> 
                4. 您将密码告知他人导致的财产损失；  <br> 
                5. 因您个人的故意或重大过失所造成的财产损失。  <br> 
                6.因您个人涉及知识产权侵权等不正当手段竞争获利后造成财产损失。 <br> 
                第十五条【客观因素】伯马乐业平台因下列状况无法正常运作，使您无法使用马蹄或其他服务或造成您的马蹄丢失时，我们将尽可能及时修复，但是由此给您造成的损失，伯马乐业在法律允许的范围内免责，包括但不限于：  <br> 
                1. 系统停机维护、升级、调整期间；  <br> 
                2. 电信通讯或设备出现故障不能进行数据传输的；  <br> 
                3. 因台风、地震、海啸、洪水、停电、战争、恐怖袭击、政府管制等不可抗力之因素，造成伯马乐业平台系统障碍不能执行业务的； <br>  
                4. 由于黑客攻击、电信部门技术调整或故障、网站升级、相关第三方的问题等原因而造成的服务中断或者延迟。<br> 

                <h4>第五章 附则</h4> <br> 

                第十六条【通知】我们可能会不定时对服务的功能、规则等进行调整，并对本协议进行修改，本协议的更新版本将以公告于伯马乐业平台的官网首页或 App 推送等方式通知您。若您在本协议内容发生修订后，继续使用本服务的，则视为您同意最新修订的协议内容；您如不同意最新修订的协议内容，请立即停止使用相关服务。  <br> 
                第十七条【法律适用及管辖】本协议的生效、履行、解释及争议的解决均适用中华人民共和国的现行法律，所发生的争议应提交西安市仲裁委员会，其仲裁裁决是终局的。本用户协议因与中华人民共和国现行法律相抵触而导致部分条款无效的，不影响其他条款的效力。 <br> 
                第十八条【合同的可分性】如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。无法适用的条款将会被修改，以便其能够依法适用。<br> 
        </div>
    </div>
</template>
<script>
export default {
    methods: {
       routerToWalletDetail() {
            this.$router.back(-1)
        } 
    }
}
</script>
<style lang="scss" rel="stylesheet/scss" scoped>
@function pxTorem($px, $base-font-size: 75px) {
    @if (unitless($px)) {
        @warn "Assuming #{$px} to be in pixels, attempting to convert it into pixels for you";
        @return px2em($px + 0px);
    } @else if (unit($px) == em) {
        @return $px;
    }
    @return ($px / $base-font-size) * 1rem;
}
.main {
    display: flex;
    flex-direction: column;
    padding: pxTorem(140px) 0 pxTorem(100px);
    width: 100%;
    .wallet-nav {
        width: 100%;
        position: fixed;
        background: #ffffff;
        top: 0;
        display: flex;
        justify-content: space-between;
        align-items: flex-end;
        min-height: pxTorem(80px);
        padding-bottom: pxTorem(48px);
        border-bottom: 1px solid #E6E6E6;
        img {
            margin: 0 pxTorem(32px);
        }
        img:nth-child(1) {
            width: pxTorem(18px);
            height: pxTorem(32px);
        }
         img:nth-child(3) {
            width: pxTorem(18px);
            height: pxTorem(36px);
            opacity: 0;
        }
        span {
            font-size: pxTorem(38px);
            font-family: PingFang SC;
            font-weight: 550;
            color: #2D3740;
            line-height: pxTorem(38px);
        }
    }
    .title {
        width: 100%;
        display: flex;
        justify-content: center;
    }
    .content {
        padding: pxTorem(32px);
    }
}
</style>